landing_page_principale/app/controllers/pages_controller.rb

SELECT  "visiteurs".* FROM "visiteurs" WHERE "visiteurs"."email" = ? LIMIT ?  [["email", "fenitraandrianaivosoa@gmail.com"], ["LIMIT", 1]]
INSERT INTO "visiteurs" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "aaaa@aaa.com"], ["created_at", "2018-05-18 11:01:00.113971"], ["updated_at", "2018-05-18 11:01:00.113971"]]
---
  def soumettre
    visiteur = Visiteur.find_by(email: params['soumettre'].downcase)
    if visiteur
    #visiteur existe
    #redirect_to root_path
      redirect_to "https://www.thehackingproject.org", notice: "Merci d'avoir visité notre site"
    else
      @visiteur = Visiteur.create(email: params['soumettre'].downcase)